src/cf/src/InformationRegisters/ЛицаСПравомПодписи/ЛицаСПравомПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛицаСПравомПодписи</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>ОснованиеПраваПодписи</name>
    <type>
      <types>EnumRef.ОснованияПраваПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравоПодписиДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравоПодписиНомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОтветственного</name>
    <type>
      <types>EnumRef.ТипыОтветственныхЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЛицаСПравомПодписи/ManagerModule.bsl
Процедура УдалитьДанные(Организация, ФизическоеЛицо) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЛицаСПравомПодписи.Период КАК Период,
	                      |	ЛицаСПравомПодписи.Организация КАК Организация,
	                      |	ЛицаСПравомПодписи.ТипОтветственного КАК ТипОтветственного
	                      |ИЗ
	                      |	РегистрСведений.ЛицаСПравомПодписи КАК ЛицаСПравомПодписи
	                      |ГДЕ
	                      |	ЛицаСПравомПодписи.Организация = &Организация
	                      |	И ЛицаСПравомПодписи.ФизическоеЛицо = &ФизическоеЛицо");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		МЗ = РегистрыСведений.ЛицаСПравомПодписи.СоздатьМенеджерЗаписи();
		МЗ.Период = Выб.Период;
		МЗ.Организация = Выб.Организация;
		МЗ.ТипОтветственного = Выб.ТипОтветственного;
		МЗ.Удалить();	
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаписатьДанные(Период, Организация, ТипОтветственного, ФизическоеЛицо) Экспорт
	МЗ = РегистрыСведений.ЛицаСПравомПодписи.СоздатьМенеджерЗаписи();
	МЗ.Период = ?(ЗначениеЗаполнено(Период), Период, Дата(2000, 1, 1));
	МЗ.Организация = Организация;
	МЗ.ТипОтветственного = ТипОтветственного;
	МЗ.ФизическоеЛицо = ФизическоеЛицо;
	МЗ.Записать(Ложь);	
КонецПроцедуры
